http/results/retro2-effects-uring-R10000-r1.txt
Running 20s test @ http://127.0.0.1:19204/
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.915ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.502ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 2.092ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.100ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.21ms    2.24ms  22.40ms   90.60%
    Req/Sec     2.63k   669.45     6.55k    82.16%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.59ms
 75.000%    2.20ms
 90.000%    4.09ms
 99.000%   11.79ms
 99.900%   19.31ms
 99.990%   21.84ms
 99.999%   22.40ms
100.000%   22.42ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.137     0.000000            2         1.00
       0.761     0.100000         9886         1.11
       0.996     0.200000        19770         1.25
       1.198     0.300000        29655         1.43
       1.387     0.400000        39492         1.67
       1.586     0.500000        49391         2.00
       1.686     0.550000        54326         2.22
       1.791     0.600000        59272         2.50
       1.906     0.650000        64188         2.86
       2.042     0.700000        69117         3.33
       2.205     0.750000        74068         4.00
       2.305     0.775000        76518         4.44
       2.431     0.800000        78973         5.00
       2.601     0.825000        81448         5.71
       2.863     0.850000        83914         6.67
       3.259     0.875000        86382         8.00
       3.565     0.887500        87608         8.89
       4.085     0.900000        88843        10.00
       4.879     0.912500        90077        11.43
       5.711     0.925000        91312        13.33
       6.411     0.937500        92550        16.00
       6.723     0.943750        93160        17.78
       7.087     0.950000        93780        20.00
       7.615     0.956250        94398        22.86
       8.311     0.962500        95020        26.67
       8.975     0.968750        95637        32.00
       9.271     0.971875        95945        35.56
       9.623     0.975000        96245        40.00
       9.999     0.978125        96557        45.71
      10.415     0.981250        96868        53.33
      10.799     0.984375        97172        64.00
      11.015     0.985938        97326        71.11
      11.311     0.987500        97481        80.00
      11.639     0.989062        97637        91.43
      11.911     0.990625        97790       106.67
      12.239     0.992188        97943       128.00
      12.431     0.992969        98020       142.22
      12.695     0.993750        98097       160.00
      13.063     0.994531        98173       182.86
      13.495     0.995313        98250       213.33
      14.391     0.996094        98327       256.00
      14.751     0.996484        98366       284.44
      15.103     0.996875        98404       320.00
      15.351     0.997266        98443       365.71
      15.791     0.997656        98481       426.67
      16.359     0.998047        98520       512.00
      16.559     0.998242        98539       568.89
      17.039     0.998437        98558       640.00
      18.527     0.998633        98578       731.43
      19.023     0.998828        98597       853.33
      19.327     0.999023        98616      1024.00
      19.727     0.999121        98627      1137.78
      19.919     0.999219        98635      1280.00
      20.271     0.999316        98645      1462.86
      20.383     0.999414        98655      1706.67
      20.495     0.999512        98664      2048.00
      20.575     0.999561        98670      2275.56
      20.655     0.999609        98674      2560.00
      20.751     0.999658        98680      2925.71
      21.007     0.999707        98684      3413.33
      21.151     0.999756        98688      4096.00
      21.247     0.999780        98691      4551.11
      21.375     0.999805        98693      5120.00
      21.455     0.999829        98696      5851.43
      21.743     0.999854        98698      6826.67
      21.823     0.999878        98701      8192.00
      21.839     0.999890        98702      9102.22
      21.903     0.999902        98704     10240.00
      21.903     0.999915        98704     11702.86
      21.919     0.999927        98705     13653.33
      21.951     0.999939        98706     16384.00
      21.967     0.999945        98707     18204.44
      22.015     0.999951        98708     20480.00
      22.015     0.999957        98708     23405.71
      22.047     0.999963        98709     27306.67
      22.047     0.999969        98709     32768.00
      22.079     0.999973        98710     36408.89
      22.079     0.999976        98710     40960.00
      22.079     0.999979        98710     46811.43
      22.399     0.999982        98711     54613.33
      22.399     0.999985        98711     65536.00
      22.399     0.999986        98711     72817.78
      22.399     0.999988        98711     81920.00
      22.399     0.999989        98711     93622.86
      22.415     0.999991        98712    109226.67
      22.415     1.000000        98712          inf
#[Mean    =        2.205, StdDeviation   =        2.241]
#[Max     =       22.400, Total count    =        98712]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  197060 requests in 20.00s, 398.04MB read
Requests/sec:   9851.75
Transfer/sec:     19.90MB

JSON Output:
{
	"requests": 197060,
	"duration_in_microseconds": 20002544.00,
	"bytes": 417373080,
	"requests_per_sec": 9851.75,
	"bytes_transfer_per_sec": 20865999.84,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 1586
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 2205
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 4085
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 11791
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 19311
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 21839
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 22399
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 22415
		}
	]
}