http/results/retro2-effects-uring-R20000-r2.txt
Running 20s test @ http://127.0.0.1:19214/
  4 threads and 100 connections
  Thread calibration: mean lat.: 3.347ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 3.307ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 2.886ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 3.133ms, rate sampling interval: 17ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.83ms    3.33ms  20.11ms   85.69%
    Req/Sec     5.15k     1.11k   10.18k    81.16%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.56ms
 75.000%    2.40ms
 90.000%    8.27ms
 99.000%   15.89ms
 99.900%   18.75ms
 99.990%   19.66ms
 99.999%   20.05ms
100.000%   20.13ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.080     0.000000            1         1.00
       0.698     0.100000        19800         1.11
       0.918     0.200000        39509         1.25
       1.132     0.300000        59302         1.43
       1.346     0.400000        79046         1.67
       1.558     0.500000        98761         2.00
       1.671     0.550000       108626         2.22
       1.796     0.600000       118470         2.50
       1.937     0.650000       128361         2.86
       2.117     0.700000       138275         3.33
       2.397     0.750000       148113         4.00
       2.647     0.775000       153037         4.44
       3.217     0.800000       157958         5.00
       4.491     0.825000       162902         5.71
       5.839     0.850000       167840         6.67
       7.003     0.875000       172773         8.00
       7.651     0.887500       175240         8.89
       8.271     0.900000       177711        10.00
       8.847     0.912500       180194        11.43
       9.391     0.925000       182665        13.33
       9.927     0.937500       185125        16.00
      10.239     0.943750       186367        17.78
      10.543     0.950000       187593        20.00
      10.911     0.956250       188830        22.86
      11.343     0.962500       190053        26.67
      11.871     0.968750       191294        32.00
      12.207     0.971875       191898        35.56
      12.615     0.975000       192514        40.00
      13.103     0.978125       193132        45.71
      13.663     0.981250       193752        53.33
      14.391     0.984375       194367        64.00
      14.831     0.985938       194679        71.11
      15.239     0.987500       194984        80.00
      15.655     0.989062       195289        91.43
      16.031     0.990625       195596       106.67
      16.543     0.992188       195909       128.00
      16.783     0.992969       196061       142.22
      17.007     0.993750       196221       160.00
      17.183     0.994531       196377       182.86
      17.423     0.995313       196525       213.33
      17.647     0.996094       196680       256.00
      17.759     0.996484       196767       284.44
      17.887     0.996875       196835       320.00
      18.047     0.997266       196909       365.71
      18.191     0.997656       196990       426.67
      18.351     0.998047       197067       512.00
      18.399     0.998242       197100       568.89
      18.479     0.998437       197141       640.00
      18.575     0.998633       197181       731.43
      18.639     0.998828       197217       853.33
      18.767     0.999023       197255      1024.00
      18.815     0.999121       197275      1137.78
      18.895     0.999219       197295      1280.00
      18.943     0.999316       197313      1462.86
      18.991     0.999414       197336      1706.67
      19.071     0.999512       197353      2048.00
      19.135     0.999561       197362      2275.56
      19.183     0.999609       197371      2560.00
      19.311     0.999658       197380      2925.71
      19.359     0.999707       197390      3413.33
      19.455     0.999756       197400      4096.00
      19.487     0.999780       197406      4551.11
      19.519     0.999805       197409      5120.00
      19.551     0.999829       197414      5851.43
      19.583     0.999854       197419      6826.67
      19.631     0.999878       197424      8192.00
      19.647     0.999890       197426      9102.22
      19.663     0.999902       197429     10240.00
      19.759     0.999915       197431     11702.86
      19.807     0.999927       197433     13653.33
      19.839     0.999939       197436     16384.00
      19.855     0.999945       197438     18204.44
      19.855     0.999951       197438     20480.00
      19.871     0.999957       197439     23405.71
      19.887     0.999963       197440     27306.67
      19.919     0.999969       197441     32768.00
      19.935     0.999973       197442     36408.89
      20.015     0.999976       197443     40960.00
      20.015     0.999979       197443     46811.43
      20.031     0.999982       197444     54613.33
      20.031     0.999985       197444     65536.00
      20.047     0.999986       197446     72817.78
      20.047     0.999988       197446     81920.00
      20.047     0.999989       197446     93622.86
      20.047     0.999991       197446    109226.67
      20.047     0.999992       197446    131072.00
      20.047     0.999993       197446    145635.56
      20.047     0.999994       197446    163840.00
      20.047     0.999995       197446    187245.71
      20.127     0.999995       197447    218453.33
      20.127     1.000000       197447          inf
#[Mean    =        2.832, StdDeviation   =        3.328]
#[Max     =       20.112, Total count    =       197447]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  394057 requests in 20.00s, 795.95MB read
Requests/sec:  19703.45
Transfer/sec:     39.80MB

JSON Output:
{
	"requests": 394057,
	"duration_in_microseconds": 19999390.00,
	"bytes": 834612726,
	"requests_per_sec": 19703.45,
	"bytes_transfer_per_sec": 41731909.12,
	"latency_distribution": [
		{
			"percentile": 50,
			"latency_in_microseconds": 1558
		},
		{
			"percentile": 75,
			"latency_in_microseconds": 2397
		},
		{
			"percentile": 90,
			"latency_in_microseconds": 8271
		},
		{
			"percentile": 99,
			"latency_in_microseconds": 15887
		},
		{
			"percentile": 99.9,
			"latency_in_microseconds": 18751
		},
		{
			"percentile": 99.99,
			"latency_in_microseconds": 19663
		},
		{
			"percentile": 99.999,
			"latency_in_microseconds": 20047
		},
		{
			"percentile": 100,
			"latency_in_microseconds": 20127
		}
	]
}